2023/Fichiers_tex/rapport-2023-06-03.tex
% Created 2024-06-16 Sun 00:13
% Intended LaTeX compiler: pdflatex
ocumentclass[10pt]{article}% =================================BASE====================================%
\documentclass[10pt]{report}
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc
\usepackage{csquotes} % Recommandé par PDFLatex lors de la compilation. 


% Calligraphie
%\usepackage{lmodern} % Ça, ça set latin modern
%\usepackage{mathrsfs} %Permet la command \mathscr (Lettres attachées genre) \mathscr(B)

% Calligraphie
%\usepackage{pxfonts} % Met le texte ET les maths en Palatino + donne accès à des symboles math
\usepackage{palatino} % Cette commande met seulement le texte en police palatino
\usepackage{lmodern} % Pour les maths?
% Use lmodern for sans-serif
\usepackage{mathrsfs} % Permet la command \mathscr (Lettres attachées genre) \mathscr(B)





% Bibliographie
%\usepackage[backend=bibtex,style=phys,sorting=ynt]{biblatex}
\usepackage[backend=biber,sorting=ynt,style=ieee]{biblatex}
\addbibresource{/home/charlesedouard/Desktop/Travail/Documentation/master-bibliography.bib}



\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.
\usepackage{mathtools,cancel,xfrac} % Utilisation de boîtes \boxed{} + \cancelto{}{}, xfrac
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage{colortbl} % Color tables
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.
\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% Physique
\usepackage{physics} % Meilleur package pour physicien. 


% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usepackage{empheq} % Boite autour de MULTIPLE équations
\usepackage{bbding}

% Français
\usepackage[french]{babel} % Environnements en Français.
% ==============================BASE-(END)=================================%



% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
\rowcolors{2}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% Physique
\usepackage{physics} % Meilleur package pour physicien. 


% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usepackage{empheq} % Boite autour de MULTIPLE équations

% Français
\usepackage[french]{babel} % Environnements en Français.
% ==============================BASE-(END)=================================%





% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
\rowcolors{2}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}

% Retirer l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}

% Change bullet style
\usepackage{pifont}
\usepackage{enumitem}
%\setlist[itemize,1]{label=\ding{224}}
\setlist[itemize,1]{label=\ding{239}}
\renewcommand{\boxtimes}{\blacksquare}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}
\newcommand{\uu}{\vb{u}}
\newcommand{\vv}{\vb{v}}
\newcommand{\ust}{\vb{u}_{\ast}}

% Physics empty spaces 
\newcommand{\typical}{\vphantom{A}}
\newcommand{\tall}{\vphantom{A^{x^x}_p}}
\newcommand{\grande}{\vphantom{\frac{1}{xx}}}
\newcommand{\venti}{\vphantom{\sum_x^x}}
\newcommand{\pt}{\hspace{1pt}} % One horizontal pt space

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}
\newcommand{\zmean}[1]{\overline{#1}^z}
\newcommand{\xymean}[1]{\overline{#1}^{xy}}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
\newcommand{\tphi}{\tilde{\phi}}

% Nota Bene env : (\ding{89})
%\newcommand{\nb}{$\boxed{\text{\footnotesize\EightStarConvex}\pt \mathfrak{N. B.}}$\hspace{4pt}}
\newcommand{\nb}{\underline{{\footnotesize\EightStarConvex}\pt $\mathfrak{N.B.}$\vphantom{p}}\hspace{3pt}}


% Define the nota bene environment
\usepackage{tcolorbox}
\newtcolorbox{notabene}{
     colback=blue!5,
     colframe=black,
     boxrule=0.5pt,
     arc=2pt,
     left=5pt,
     right=5pt,
     top=5pt,
     bottom=5pt,
}


\newcommand{\cmark}{\ding{52}}
\newcommand{\xmark}{\ding{55}}
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Huge Contrat Été 2023 \par}
\vspace{2cm}
{\Huge \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Huge ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR\\
Police d'écriture : \textbf{CMU Serif Roman}
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{0.025pt} % Ligne horizontale en haut

\fancyhead[R]{\textit{\thetitle}}
\fancyhead[L]{\ \thepage}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{03/06/2023}
\title{Carnet de bord, Université McGill}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Carnet de bord, Université McGill},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6.7)}, 
 pdflang={French}}
\begin{document}

\mytitlepage
\tableofcontents\newpage

\section{Erreurs rencontrées}
\label{sec:orgf3000b1}

\subsection{Ancienne méthode : Calculer la fonction de courant barotrope directement}
\label{sec:orgffcd703}
Concrétement, l'ancienne méthode (voir \href{rapport-2023-04-28.org}{rapport précédent}) consistait à trouver le rotationnel de \(\uu_{BT}\), soit \(\zeta_{BT} = \curl(\uu_{BT})\) pour solutionner l'équation de Poisson,
\begin{equation}
\label{eq:org5f2318d}
   \laplacian(\psi_{BT}) =  \norm{\pt\curl{\uu_{BT}}\pt}.
\end{equation}
Une foit \(\psi_{BT}\) en main, il est trivial (on s'en rapelle) de retrouver \(\uu_{BT}\) à l'aide de la relation
\begin{equation}
   \uu = \kvf\times\gradient{\psi} = - \qty(\curl{\kvf\psi}).
\end{equation}

Malheureusement, certains problèmes émergeaient de l'application de cette méthode.

\subsection{Fluctuation relative de la fonction de courant barotrope}
\label{sec:org25e6af2}
On définit la fluctuation relative de la fonction de courant barotrope \(\delta \psi_{BT}\) de sorte que cette quantité satisfait la relation
\begin{equation}
   \psi_{BT}^{t+\delta t} = \psi_{BT}^t + \delta \psi_{BT} + Er\pt(\psi_{BT}),
\end{equation}
où \(Er\pt(\psi_{BT})\) est une fonction pseudo-aléatoirement linéaire qui représente l'erreur numérique associée à une solution.
Cette dernière est proportionnelle à la solution de l'équation \ref{eq:orge478c1c}, de sorte que
\begin{equation}
    Er\pt(\psi_{BT}) \propto \psi_{BT}.
\end{equation}
Alors, si l'on solve l'équation \ref{eq:orge478c1c} avec une précision de 5 chiffres par exemple, l'erreur par rapport à la fluctuation relative de la fonction de courant barotrope va se faire sentir sur les résultats.
Essentiellement, l'erreur numérique donne naissance à l'inégalité suivante
\begin{align}
   &&\text{Erreur relative} = \abs{\frac{Er\pt(\psi_{BT})}{\psi_{BT}}} \le \abs{ \frac{Er\pt(\psi_{BT})}{\delta \psi_{BT}} } &&\text{car (généralement)} && \abs{\psi_{BT}} \ge \abs{\delta \psi_{BT}}. &&
\end{align}
Donc, si l'on veut diminuer l'échelle de l'erreur numérique relative, on doit absolument solutionner \(\delta \psi_{BT}\) plutôt que \(\psi_{BT}\) sinon on perd une résolution importante.
Encore une fois, on y faisait référence dans le \href{rapport-2023-04-28.org}{rapport précédent}.
Si l'on faisait ça, nous aurions plutôt
\begin{align}
   \text{Erreur relative} = \underbrace{\qty{\ \abs{\frac{Er\pt(\delta\psi_{BT})}{\psi_{BT}}} \le \abs{ \frac{Er\pt(\delta\psi_{BT})}{\delta \psi_{BT}} }\ }}_\text{Solution $\delta \psi_{BT}$}
   <<
   \underbrace{\qty{\ \abs{\frac{Er\pt(\psi_{BT})}{\psi_{BT}}} \le \abs{ \frac{Er\pt(\psi_{BT})}{\delta \psi_{BT}} }\ }.}_\text{Solution $\psi_{BT}$}
\end{align}
Nous aurions donc bien des avantages à changer de méthode (on va le faire).

\subsection{Pas de temps}
\label{sec:org5f47612}

Techniquement, on peut argumenter que nous calculions 2 fois le pas de temps, accidentellement.
En différences finies, les équations du mouvement ont la forme
\begin{equation}
\label{eq:orgdd40fdf}
   \uu^{t+\delta t} =
   \underbrace{\uu^t + RHS\cdot \Delta t\tall}_{\tilde{u}}
   \underbrace{- \gradient{\phi}\cdot \Delta t.\tall}_\text{Correction P}
\end{equation}
Par définition, on sait que
\begin{equation}
   \laplacian{\psi^{t+\delta t}} = \zeta^{t+\delta t},
\end{equation}
et on décompose en partie barotrope et barocline, de sorte que
\begin{align}
   && \laplacian{\psi^{t+\delta t}_{BT} + \psi^{t+\delta t}_{BC}} = \zeta^{t+\delta t}_{BT} + \zeta^{t+\delta t}_{BC}
   && \Longrightarrow
   && \laplacian{\psi^{t+\delta t}}_{BT} = \zeta^{t+\delta t}_{BT},
   && \text{et}
   && \laplacian{\psi^{t+\delta t}}_{BC} = \zeta^{t+\delta t}_{BC}.&&
\end{align}
Comme présenté à l'équation \ref{eq:orgdd40fdf}, on peut décomposer le RHS de la dernière équation selon
\begin{align}
   \laplacian{\psi^{t+\delta t}}_{BT} = \tilde{\zeta}_{BT} - \cancelto{0}{\curl(\Delta t\cdot\gradient{\phi})}.
\end{align}
On solutionne l'équation de Poisson, on trouve \(\psi^{t+\delta t}\), puis on retrouve le courant à l'aide de l'équation (à se souvenir), 
\begin{equation}
   \uu_{BT} = \kvf \times \qty(\gradient{\psi_{BT}}) = - \pt\curl(\psi_{BT}\kvf).
\end{equation}
Finalement, on additionne les parties barocliniques et barotropes pour obtenir
\begin{equation}
\label{eq:orge4cdb97}
   \uu^{t+\delta t} = \uu_{BT}^{t+\delta t} + \uu_{BC}^{t+\delta t}.
\end{equation}
Donc au final, s'il y a une erreur, elle est à l'équation \ref{eq:orge4cdb97}.
Concrétement, on additionne deux parties qui constituent une même chose.
Par contre, on obtient ces quantités depuis une quantités qui est entre deux pas de temps, à un temps peu définit.
Par exemple, on assume que
\begin{equation}
   \uu^{t+\delta t} = \tilde{\uu} - \gradient{\phi} \cdot \Delta t.
\end{equation}
Puis, on décompose en deux parties à l'aide de \ref{eq:orge4cdb97}, soit barotrope et baroclines,
\begin{subequations}
\begin{align}
   & \uu^{t+\delta t}_{BT} = \zmean{\tilde{\uu} - \gradient{\phi} \cdot \Delta t}  = \tilde{\uu}_{BT} - \gradient{\phi} \cdot \Delta t,\\
   & \uu^{t+\delta t}_{BC} = \uu^{t+\delta t} - \uu^{t+\delta t}_{BT}.
\end{align}
\end{subequations}
où \(\zmean{\alpha}\) dénote la moyenne verticale d'une quantité \(\alpha\).
On développe
\begin{align}
   \uu^{t+\delta t}_{BC}
   &= \uu^{t+\delta t} - \tilde{\uu}_{BT} + \gradient{\phi}\cdot \Delta t, \nonumber\\
   &= \tilde{\uu} - \gradient{\phi}\cdot \Delta t\ - \tilde{\uu}_{BT} + \gradient{\phi}\cdot \Delta t, \nonumber\\
   &= \tilde{\uu} - \tilde{\uu}_{BT}.
\end{align}
Cette dernière quantité est la définition de \(\tilde{\uu}_{BC}\), donc on devrait être convaincu que
\begin{equation}
   \boxed{\hspace{0.4cm}\uu^{t+\delta t}_{BC}
   = \tilde{\uu} - \tilde{\uu}_{BT} = \tilde{\uu}_{BC}.\hspace{0.3cm}}
\end{equation}

\section{Nouvelle méthode proposée par David}
\label{sec:org637cc6a}
Comme mentionné précédemment, il est possible de seulement calculer la correction à \(\psi_{BT}\) plutôt que \(\psi_{BT}\) pour minimiser l'erreur relative sur la solution.
On divise notre \emph{RHS} en deux parties, soit barotropes et baroclines,
\begin{equation}
   \vec{RHS} = \vec{RHS}_{BT} + \vec{RHS}_{BC}.
\end{equation}

Nous savons que les équations
\begin{align}
\label{eq:orge478c1c}
   &&\laplacian{\psi^{t+\delta t}} = \curl{\uu^{t+\delta t}}
   &&\text{et}
   &&\laplacian{\psi^{t}} = \curl{\uu^{t}}&&
\end{align}
sont toujours valides. 
On se souvient aussi que les équations du mouvement en différence finie sont données par 
\begin{equation}
   \uu^{t+\delta t} =
   \uu^t + \vec{RHS}\cdot \Delta t
   - \gradient{\phi}\cdot \Delta t.
\end{equation}
Les parties barocline et barotrope sont respectivement exprimées par
\begin{subequations}
\begin{align}
   &\uu_{BT}^{t+\delta t} = \uu_{BT}^{t} + \vec{RHS}_{BT}\cdot \Delta t - \Delta t\cdot \gradient{\phi},\grande\\
   &\uu_{BC}^{t+\delta t} = \uu_{BC}^{t} + \vec{RHS}_{BC}\cdot \Delta t,
\end{align}
\end{subequations}
étant donné que le gradient de pression est un phénomène barotrope.
Pour cette même raison, on peut justement affirmer hors de tout doute que l'équation \ref{eq:orge478c1c} est séparable en partie barotrope et barcocline, soit
\begin{subequations}
\label{eq:org99cc3f7}
\begin{align}
   &\grande\laplacian{\psi_{BT}^{t}}\ \pt = \curl{\uu_{BT}^{t}}
   \hspace{0.5cm}\text{et}\hspace{0.5cm}
   \laplacian{\psi_{BT}^{t+\delta t}} = \curl{\uu_{BT}^{t+\delta t}},\\
   &\grande\laplacian{\psi_{BC}^{t+\delta t}} = \laplacian{\tilde{\psi}_{BC}} = \curl{\uu_{BC}^{t+\delta t}} = \curl{\tilde{\uu}_{BC}},
\end{align}
\end{subequations}
car \(\tilde{\uu}_{BC} = \uu^{t+\delta t}_{BC}\).
Donc, en développant la partie barotrope, on obtient
\begin{equation}
\label{eq:orge16486a}
   \laplacian(\psi_{BT}^t+\delta \psi \cdot \Delta t) = \curl(\uu^t_{BT} + \vec{RHS}_{BT}\cdot\Delta t - \cancelto{0}{\gradient{\phi}}\cdot \Delta t),
\end{equation}
puis en soustrayant la relation \ref{eq:org99cc3f7}a à la dernière équation (\ref{eq:orge16486a}), on arrive à
\begin{equation}
   \laplacian(\delta \psi) = \curl(\vec{RHS}_{BT}).
\end{equation}
Finalement, on retrouve la partie barotrope de notre \emph{RHS} à l'aide de la relation
\begin{equation}
   \delta \uu_{BT} = \kvf\times\gradient(\delta \psi) = -\curl(\delta\psi\pt\kvf).
\end{equation}
Pour terminer avec
\begin{equation}
   \uu^{t+\delta t} =
   \uu^t + \Delta t\cdot\qty(\vec{RHS}_{BC}
   + \delta \uu_{BT}).
\end{equation}
\end{document}